{
    "id": 11,
    "title": "Low-Calorie French Toast Recipe: Delicious and Weight Loss Friendly",
    "description": "Looking for a tasty but calorie-conscious breakfast? This innovative French toast recipe is under 200 kcal, making it perfect for a weight-loss regime while maintaining all the classic flavors.",
    "image": "icons/Frenchtoast1.jpg",
    "content": [
        {
            "type": "heading",
            "text": "Low-Calorie French Toast Recipe"
        },
        {
            "type": "paragraph",
            "text": "Servings: 1 | Calories: 190 kcal"
        },
        {
            "type": "heading",
            "text": "Ingredients"
        },
        {
            "type": "list",
            "items": [
                "1 slice of whole grain or low-calorie bread (about 60 kcal)",
                "1 egg white (17 kcal)",
                "2 tablespoons unsweetened almond milk (5 kcal)",
                "1/4 teaspoon vanilla extract (optional)",
                "1/4 teaspoon cinnamon",
                "1 teaspoon honey or sugar-free syrup (optional, 15 kcal)",
                "1/4 cup mixed berries (20 kcal)",
                "Cooking spray or a tiny dab of coconut oil (10 kcal)"
            ]
        },
        {
            "type": "heading",
            "text": "Instructions"
        },
        {
            "type": "list",
            "items": [
                "Prepare the batter: In a small bowl, whisk the egg white, almond milk, vanilla extract, and cinnamon together until smooth.",
                "Soak the bread: Dip the whole grain bread into the egg mixture, making sure it absorbs well but doesn’t get too soggy.",
                "Cook: Heat a non-stick pan over medium heat and lightly spray with cooking spray or use a small amount of coconut oil. Cook the bread for 2-3 minutes on each side until golden brown.",
                "Top it off: Serve with a drizzle of honey or sugar-free syrup and a handful of fresh mixed berries for added sweetness and nutrition."
            ]
        },
        {
            "type": "heading",
            "text": "Nutritional Breakdown (approx)"
        },
        {
            "type": "list",
            "items": [
                "Total calories: 190 kcal",
                "Protein: 10g",
                "Carbs: 25g",
                "Fat: 5g"
            ]
        },
        {
            "type": "paragraph",
            "text": "This lightened-up version of French toast retains all the classic flavors but with fewer calories, making it a fantastic option for anyone on a weight-loss diet!"
        }
    ]
}
